{
  "name": "Lua Scripting The UI For Pocket MUD Pro",  
  "content": "I have just updated my MUD client [[Pocket MUD Pro][1]] to be a universal library. It was surprisingly easy to add the iPad support as most of the application was comprised of UITableViews.\n\nThe main “MUD” view was the most challenging part as it contains a couple UIWebViews, UIButons, and a UITextField. However, I chose to do something I feel is pretty cool.\n\n#### Scripting The UI With Lua\n\nIf I haven’t said it enough, I love lua. Especially in the context of scripting within other applications. Pocket MUD Pro already has complete lua support in triggers in aliases, so I figured I might as well apply that same logic to the UI.\n\nPocket MUD Pro has 3 core sections for the UI not counting the text input field. The main view (UIWebview), the prompt view (UIWebview), and the button bar (custom UIView).\n\nOne of the core challenges I faced on the iPhone, was resizing/reorienting all of these views on orientation change as well as when the keyboard was visible and when it wasn’t. To be honest, I spent most of my cycles getting this part right. On the iPad, I decided to things a little differently which improved the speed of my development overall and paved the way for future updates that will allow user-scripted UIs.\n\n#### The UI Script\n\nI want to start by showing you the lua code that is used to script the UI by default.\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u003ccode class=\"’lua’\"\u003e–MUD \r\nmudFrame = Frame:new(\u0026quot;mud_frame\u0026quot;) \r\nmudFrame.type = FrameTypeMUD\r\nmudFrame.portraitFrame = {0,0,768,931}\r\nmudFrame.portraitFrameKeyboard = {0,0,768,667}\r\nmudFrame.landscapeFrame = {0,0,1024,675}\r\nmudFrame.landscapeFrameKeyboard = {0,0,1024,323}\r\ncreateFrame(mudFrame)\u003c/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\nWhat’s happening here is, I have created a Frame class that has some properties (type, name, etc…) and injected it into the global lua space for use inside of the UIScripts. Then when the interface gets drawn, I reference the UI script for each of the MUD servers and use it to render the interface.\n\nOne interesting thing here is, I set the frames for each of the possible layout scenarios. Portrait, Landscape, with and without the keyboard. That way, when the keyboard hides/dismisses or the user rotates the device, I just reference the this script again and re-render the frame accordingly. This could have been achieved with auto-resizing masks however, it gets much more complex and things get tricky when you want to have a dynamic number of windows.\n\nI follow this exact pattern for the button frames and the prompt frames. As you might have guessed, in a future release, I will open this script area up to MUDders and give the user the ability to script the interface however they would like. Some examples might be:\n\n  * Dedicated map window\n  * Dedicated chat window\n  * Customized movement buttons\n  * Customized backgrounds/borders/themes\n  * Custom health/status/mana\n\nGiven this powerful UI Scripting style, a user will be able to create complex interfaces such as the one below from inside the app:\n\n\u003cimg class=\"alignnone\" title=\"Achaea\" alt=\"\" src=\"http://img.brothersoft.com/screenshots/softimage/a/achaea-300819-1263188763.jpeg\" width=\"450\" /\u003e\n\nI still have a ways to go with exposing various functionalities via my custom lua bridge. But things seem to be moving along quite smoothly.\n\nIf you want to learn how I was able to bridge lua into my application, consider checking out my talk on lua scripting at [360iDev 2012][2] later this year!\n\nHappy Coding!\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Lua Scripting The UI For Pocket MUD Pro\" data-url=\"http://brandontreb.com/lua-scripting-the-ui-for-pocket-mud-pro\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n\n [1]: http://itunes.apple.com/us/app/pocket-mud-pro/id511678455?mt=8\n [2]: http://360idev.com/\n",
  "permalink" : "https://brandontreb.ngrok.io/2012/05/29/lua-scripting-the-ui-for-pocket-mud-pro/",
  "date":"2012-05-29T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2012-05-29T00:00:00Z","post_type":"article","publishdate":"2012-05-29T00:00:00Z","slug":"lua-scripting-the-ui-for-pocket-mud-pro","tags":["Uncategorized","iDevBlogADay"],"title":"Lua Scripting The UI For Pocket MUD Pro","type":"post"
}