{
  "name": "Idea: ChatGPT For Filtering Social Media Feeds",  
  "content": "![](https://images.unsplash.com/photo-1579869847557-1f67382cc158?ixlib=rb-4.0.3\u0026ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8\u0026auto=format\u0026fit=crop\u0026w=1000\u0026q=80)\r\n\r\nWhile I was still using Twitter, I set up _a ton_ of keyword filters.  This was especially true during the election seasons.  I prefer using social media to connect with people and find communities surrounding my hobbies and interests.  \r\n\r\nWhile these filters did an _ok_ job, they often times had false positives and filtered out content that I was actually interested in.  An example of this might be a filter on the word **Trump**. My intention was to remove posts around former president Trump as I really have no interest in such discussions.  However, this might filter out something like this:\r\n\r\n_\"I really feel that React trumps Angular in front-end web development\"_\r\n\r\nUsing keyword filtering, I would have missed out on an otherwise interesting conversation. \r\n\r\n**ChatGPT To The Rescue**\r\n\r\nLet's say for example, that I want to only see posts about **crypto** and **AI** from [my blog's JSON feed](https://brandontreb.com/feed.json). I could write a prompt like this:\r\n\r\n```\r\nconst prompt  = `\r\nGiven the following JSON array of posts where the content key contains the \r\nHTML of the post:    \r\n    \r\n${JSON.stringify(content)}\r\n\r\nfilter out all posts that are about crypto or AI, and then return the JSON \r\nstring containing the post id from the original post array.`\r\n```\r\n  \r\nIn this case the content is just structured JSON data of my blog.  The returned result is\r\n\r\n```\r\n[{\r\n\t\"id\": \"https://brandontreb.com/2023/01/23/p79q7wz6hlqmckertv2y9\"\r\n}, {\r\n\t\"id\": \"https://brandontreb.com/2023/01/23/xh7qs5zhj69bbas75c63\"\r\n}, {\r\n\t\"id\": \"https://brandontreb.com/2023/01/22/tfiettm6fumf0focwa8n0a\"\r\n}, {\r\n\t\"id\": \"https://brandontreb.com/2023/01/21/6fd95o3q7ihqbqga6hp5e8\"\r\n}]\r\n```\r\n\r\nIn this example, each of the posts are accurately classified as being about crypto or AI though they may or may not contain those keywords.  \r\n\r\nUsing this method, we can now filter out social media feeds in much more interesting and dynamic ways. I could now say something like \r\n\r\n\"_Don't show me political discussions that are negative in nature_\". \r\n\r\nThis way, I can still be a part of interesting conversations without risking my sanity.  \r\n\r\nI'm very interested and excited to explore this further and would love to hear your thoughts on it.\n",
  "permalink" : "https://brandontreb.ngrok.io/2023/01/25/vpyzaaro5pjr8y3axaqag9/",
  "date":"2023-01-25T14:54:52.172Z","draft":false,"iscjklanguage":false,"lastmod":"2023-01-25T14:54:52.172Z","post_type":"article","publishdate":"2023-01-25T14:54:52.172Z","slug":"vpyzaaro5pjr8y3axaqag9","title":"Idea: ChatGPT For Filtering Social Media Feeds","type":"post"
}