{
  "name": "Free App Per Day Service",  
  "content": "\u003cp style=\"text-align: center;\"\u003e\n  \u003cimg class=\"alignnone size-full wp-image-1336\" title=\"free\" src=\"/uploads/2010/free.jpeg\" alt=\"\" width=\"400\" height=\"300\" /\u003e\n\u003c/p\u003e\n\nAs many of you may know, I created a site called [Fresh Apps][1]. This site started as sort of a Digg for developer submitted iPhone apps. Since then, we have added plenty of new features and have grown a community of over 10,000 iPhone users.\n\nRecently, I have noticed a few services sprout up that basically have a schedule of apps that shift from paid to free for a given day. The most notable being [Free App A Day][2].\n\nAfter doing some research, sites such as these are charging a significant amount of money (I have heard up to $10,000) for a 1 day feature.\n\nSo, I was curious, given our user base, what do you (fellow iOS) developers think of FreshApps offering a similar service? If we did offer a similar service, here are some questions I have (and would love your feedback).\n\n  1. How would you change existing services? What new features would you like to see? what features are worthless?\n  2. How much would you pay for such a feature?\n  3. Would you be interested in having your app featured the first month for a minimal cost ($1 or so)?\n  4. Would you use an iPhone app that lists the upcoming paid to free apps?\n\nThank you all so much for your feedback. I\u0026#8217;m just in the brainstorming time of this, but I will totally keep you up to date if anything comes of it.\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Free App Per Day Service\" data-url=\"http://brandontreb.com/free-app-per-day-service\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n\n [1]: http://freshapps.com\n [2]: http://freeappaday.com\n",
  "permalink" : "https://brandontreb.ngrok.io/2010/12/28/free.jpeg/",
  "date":"2010-12-28T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2010-12-28T00:00:00Z","post_type":"article","publishdate":"2010-12-28T00:00:00Z","slug":"free-app-per-day-service","tags":["iPhone"],"title":"Free App Per Day Service","type":"post"
}