{
  "name": "Autonomous Steering Behaviors In Corona SDK Games",  
  "content": "Wow, it\u0026#8217;s already been 5 months since I was last blogging for #iDevBlogADay. The time has flown by!\n\nRecently, I have been dabbling with [Corona SDK][1] and have been getting really excited about the possibilities. For those of you who don\u0026#8217;t know, Corona SDK is a multi platform game engine that allows you to write your code in Lua and deploy on iOS and Android devices.\n\nToday I want to chat with you about Autonomous Steering Behaviors and show you how I have implemented a few of them in a small game that I\u0026#8217;m working on.\n\nHere is a short demo video of what we will be creating\n\n\u003ccenter\u003e\n  \u003cbr /\u003e \n  \n  \u003cp\u003e\n    \u003ca href=\"http://vimeo.com/24649841\"\u003eBoids Demo\u003c/a\u003e from \u003ca href=\"http://vimeo.com/user2413855\"\u003eBrandon Trebitowski\u003c/a\u003e on \u003ca href=\"http://vimeo.com\"\u003eVimeo\u003c/a\u003e.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    \u003c/center\u003e\n  \u003c/p\u003e\n  \n  \u003ch4\u003e\n    What Are Autonomous Steering Behaviors\n  \u003c/h4\u003e\n  \n  \u003cp\u003e\n    The name does sound pretty fancy. At the core they are just behaviors that define how a character interacts with the world around them in a life-like manner. Some of the main behaviors include wandering, path following, flocking, pursing and evading. The theory and algorithms for all of these behaviors and more can be found in a paper published by Craig Reynolds in the 80\u0026#8217;s called \u003ca href=\"http://www.red3d.com/cwr/steer/\"\u003eSteering Behaviors For Autonomous Characters\u003c/a\u003e.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    While I admit I didn\u0026#8217;t quite read all of it, the paper contains some incredible gems in terms of making your character AI seem much more life like.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    There are plenty of examples (especially in games) where these behaviors come in handy. Perhaps the easiest behavior to implement is wander. Say for example you have an NPC (non player character) that walks around a village. The wander algorithm is a perfect fit to make it seem like that NPC is actually \u0026#8220;thinking\u0026#8221; about where he\u0026#8217;s going and keeps your animations looking smooth.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    The seek and evade is another interesting algorithm. Often times in our games, we want enemies to chase after us without it seeming like they have the exact shortest path to use. It adds a bit of randomness and makes your enemies seem much more realistic.\n  \u003c/p\u003e\n  \n  \u003ch4\u003e\n    How Can I Use Them In My Corona SDK Game?\n  \u003c/h4\u003e\n  \n  \u003cp\u003e\n    After doing a bit of research, I found this \u003ca href=\"http://www.shiffman.net/teaching/nature/steering/\"\u003eincredible site by daniel shiffman\u003c/a\u003e that detailed some of the algorithms using processing. This at least took the words from the paper and made them in to some code. I really suggest that you read up on that page to get a solid understanding of what we are doing here. Rather than simply regurgitating what Daniel wrote, I\u0026#8217;m going to focus on showing you how his code can be ported for use in your Corona SDK games.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    The first challenge was, the code relies heavily on using 2D vectors. Now, I didn\u0026#8217;t see a nice built-in way to do this in Corona or Lua for that matter. So I decided to roll my own Vector2D class. For those Corona SDK veterans reading this, feel free to blast me in the comments if I\u0026#8217;m reinventing the wheel with this and just failed to fully read the documentation. Otherwise, enjoy this Vector2D class!\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    \u003ca href=\"https://gist.github.com/1006414\"\u003eHere is the link\u003c/a\u003e to the gist containing that file.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Here is a short snippet of that class just to add to the aesthetics of this post:\n  \u003c/p\u003e\n  \n  \u003cdiv\u003e\n    \u003cpre\u003e\u0026lt;code class=’lua’\u003efunction Vector2D:new(x, y)  – The constructor\n  local object = { x = x, y = y }\n  setmetatable(object, { __index = Vector2D })  – Inheritance\n  return object\nend\n\nfunction Vector2D:normalize()\n    local temp\n    temp = self:magnitude()\n    if temp \u0026gt; 0 then\n        self.x = self.x / temp\n        self.y = self.y / temp\n    end\nend\n\nfunction Vector2D:dot(vec)\n    return self.x * vec.x + self.y * vec.y\nend\u0026lt;/code\u003e\u003c/pre\u003e\n  \u003c/div\u003e\n  \n  \u003cp\u003e\n    Basically it\u0026#8217;s a lua \u0026#8220;object\u0026#8221; that has an x and y with some helper methods for doing vector math. The lower case methods act on the current self object and the upper case methods act as static class level methods meant to return a new vector. The file is a little sloppy but it gets the job done.\n  \u003c/p\u003e\n  \n  \u003ch4\u003e\n    Creating A Boid\n  \u003c/h4\u003e\n  \n  \u003cp\u003e\n    In the paper, an autonomous character is called a Boid. There are basically 2 actions that we need to implement that are needed in most of the behaviors. They are \u003cstrong\u003esteer\u003c/strong\u003e and \u003cstrong\u003eseek\u003c/strong\u003e. \u003cstrong\u003eSteer\u003c/strong\u003e is the basis for all of the autonomous behaviors. Given a Vector2D as the target, it will return a new Vector2D for the boid\u0026#8217;s acceleration in the direction of the target. We simply wrap this call in the \u003cstrong\u003eseek\u003c/strong\u003e method. Now, any behavior can call \u003cstrong\u003eseek\u003c/strong\u003e in order to direct the boid towards a target.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    \u003ca href=\"https://github.com/brandontreb/Boids/blob/master/Boid.lua\"\u003eHere is a link to our Boid on github\u003c/a\u003e\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    A snippet of the wander function\n  \u003c/p\u003e\n  \n  \u003cdiv\u003e\n    \u003cpre\u003e\u0026lt;code class=’lua’\u003efunction Boid:wander()\n    local wanderR = 16.0\n    local wanderD = 60.0\n    local change  = 0.5\n\n    local negChange = math.random(2)\n    local randomNum = math.random() * change\n    if negChange == 2 then\n        self.wanderTheta = self.wanderTheta - randomNum\n    else \n        self.wanderTheta = self.wanderTheta + randomNum\n    end \n\n    local circleLoc = self.vel:copy()\n\n    circleLoc:normalize() \n    circleLoc:mult(wanderD)\n    circleLoc:add(self.loc)\n\n    local circleOffset = Vector2D:new(wanderR*math.cos(self.wanderTheta), \n        wanderR*math.sin(self.wanderTheta))\n    local target = circleLoc:copy()\n    target:add(circleOffset)\n\n    self.acc:add(self:steer(target))\nend\u0026lt;/code\u003e\u003c/pre\u003e\n  \u003c/div\u003e\n  \n  \u003cp\u003e\n    What I have done is taken the code from \u003ca href=\"http://www.shiffman.net/itp/classes/nature/week06_s09/wander/\"\u003eDaniel Shiffman\u0026#8217;s processing project\u003c/a\u003e and ported it directly to lua. As of right now, I have only implemented wander, however you can see how easy it is to implement other behaviors using the same techniques. Since Daniel has processing code for each of them, it\u0026#8217;s a simple matter of making them work in your lua class.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    The way wander works is, it picks random points on a circle to steer towards. These random points only vary by a fraction of a radian (defined by the \u003cstrong\u003echange\u003c/strong\u003e variable above) from the current steer point. The larger the change value is, the more your boid will appear jittery. This value must be tweaked to fit the wander style for your game. Based on my testing, .5 seems to generate a pretty smooth wander path.\n  \u003c/p\u003e\n  \n  \u003ch4\u003e\n    Putting It All Together\n  \u003c/h4\u003e\n  \n  \u003cp\u003e\n    In your own code you might want to build directly on top of my boid class or subclass it for each boid type. In the following example, I\u0026#8217;m going to show you how to simply run our boid class and watch some dots wander around (hang on to your hats).\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    \u003ca href=\"https://github.com/brandontreb/Boids/blob/master/main.lua\"\u003eHere is a link to main.lua on github\u003c/a\u003e, but I have also pasted it here so we can talk about it.\n  \u003c/p\u003e\n  \n  \u003cdiv\u003e\n    \u003cpre\u003e\u0026lt;code class=’lua’\u003elocal Boid = require(‘Boid’)\n\n– Define some limiting constants\nMAX_FORCE = 1.75\nMAX_SPEED = 2.0\n\nlocal wanderers = {}\n\nfunction animate(event) \n    for i=1,#wanderers do\n        local wanderer = wanderers[i]\n        wanderer:wander()\n        wanderer:run()\n    end\nend\n\nfunction Main()\n    math.randomseed( os.time() )\n    \n    for i=1,10 do\n        local loc = Vector2D:new(display.contentWidth / 2,display.contentWidth / 2)\n        local wanderer = Boid:new(loc,MAX_FORCE,MAX_SPEED)\n        table.insert(wanderers,wanderer)\n    end\n    \n    Runtime:addEventListener( \"enterFrame\", animate );\nend\n\nMain()\u0026lt;/code\u003e\u003c/pre\u003e\n  \u003c/div\u003e\n  \n  \u003cp\u003e\n    Here we declare an array of wanderers. In the Main() method we initialize each one, insert them into the array, and add a hook to call our animate method for each frame. Inside of the animate method, we simply tell each wanderer to wander and then run itself. The boid class will take care of the rest.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    One thing to note is, the boids are unaware of each other at this time. That requires a cohesion method. I have it written and might post it up at a later time; I just want to keep things simple for now. Please feel free to ask me questions in the comments or \u003ca href=\"http://twitter.com/brandontreb\"\u003ewrite me on Twitter\u003c/a\u003e.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    You can download or fork the full source for this project \u003ca href=\"https://github.com/brandontreb/Boids\"\u003ehere\u003c/a\u003e.\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    Happy Coding!\n  \u003c/p\u003e\n  \n  \u003cp\u003e\n    \u003cspan style=\"font-family: ‘Lucida Grande’;\"\u003e\u003cstrong\u003e\u003cspan style=\"font-weight: normal;\"\u003e\u003cspan style=\"font-family: arial, verdana, tahoma, sans-serif; font-size: 13px; line-height: 20px;\"\u003e\u003cem\u003e﻿﻿This post is part of \u003ca style=\"text-decoration: none; color: #004199; padding: 0px; margin: 0px;\" href=\"http://idevblogaday.com/\"\u003eiDevBlogADay\u003c/a\u003e, a group of indie iOS development blogs featuring two posts per day. You can keep up with iDevBlogADay through the \u003ca style=\"text-decoration: none; color: #004199; padding: 0px; margin: 0px;\" href=\"http://idevblogaday.com/\"\u003eweb site\u003c/a\u003e, \u003ca style=\"text-decoration: none; color: #004199; padding: 0px; margin: 0px;\" href=\"http://feeds.feedburner.com/idevblogaday\"\u003eRSS feed\u003c/a\u003e, or \u003ca style=\"text-decoration: none; color: #004199; padding: 0px; margin: 0px;\" href=\"http://twitter.com/#search?q=%23idevblogaday\"\u003eTwitter\u003c/a\u003e.\u003c/em\u003e\u003c/span\u003e\u003c/span\u003e\u003c/strong\u003e\u003c/span\u003e\n  \u003c/p\u003e\n  \n  \u003cdiv style=\"\"\u003e\n    \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Autonomous Steering Behaviors In Corona SDK Games\" data-url=\"http://brandontreb.com/autonomous-steering-behaviors-in-corona-sdk-games\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n  \u003c/div\u003e\n\n [1]: http://www.anscamobile.com/corona/\n",
  "permalink" : "https://brandontreb.ngrok.io/2011/06/04/autonomous-steering-behaviors-in-corona-sdk-games/",
  "date":"2011-06-04T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2011-06-04T00:00:00Z","post_type":"article","publishdate":"2011-06-04T00:00:00Z","slug":"autonomous-steering-behaviors-in-corona-sdk-games","tags":["Game Development"],"title":"Autonomous Steering Behaviors In Corona SDK Games","type":"post"
}