{
  "name": "Case Of The Mondays",  
  "content": "\u003cdiv id=\"attachment_1421\" class=\"wp-caption alignright\" style=\"width: 330px\"\u003e\n  \u003ca href=\"/uploads/2011/office-spacejpg.jpeg\"\u003e\u003cimg class=\"size-full wp-image-1421 \" title=\"office-spacejpg\" src=\"/uploads/2011/office-spacejpg.jpeg\" alt=\"\" width=\"320\" height=\"240\" /\u003e\u003c/a\u003e \n  \n  \u003cp class=\"wp-caption-text\"\u003e\n    Mondays\u0026#8230;\n  \u003c/p\u003e\n\u003c/div\u003e\n\nThe other day, I was faced with an interesting programming challenge and wanted to share my solution. I just submitted a pretty interesting app to the app store that does a number of things (more details soon). Among those things is the ability to generate a calendar.\n\n#### The Problem\n\nGenerating the calendar was the easy part, however when displayed, I wanted it to highlight every Monday of the month. This turned out to be a bit trickier than I imagined.\n\nReally the main challenge here was to determine which day contained the *first* Monday of the month. After that, we just loop incrementing by 7 and are done.\n\n#### Looking At The Date Helpers\n\nLooking at what I had to work with in NSDate, NSCalendar, and NSDateComponents, I really found only 2 things that could help me. From NSDateComponents, I could figure out the current day (numeric) and the current day of the week (numeric). Knowing this information was very important.\n\n#### The Solution\n\nHaving the current day and day of the week allowed me to find the date of the Monday on the current week. This was the first challenge as demonstrated below. Assume weekdayComponents is the NSDateComponents generated from the current date.\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u0026lt;code class=’objc’\u003eNSInteger weekday = [weekdayComponents weekday];\nNSInteger day         = [weekdayComponents day];\n\n// First, find how many days we are from Monday\nint daysAwayFromMonday = weekday - 2;\n\n// Now resolve the monday of this week\nint mondayThisWeek = day - daysAwayFromMonday;\n\n// Check if monday this week falls in last month\nif(mondayThisWeek \u0026lt;= 0) {\n    mondayThisWeek = day + (7 - daysAwayFromMonday);\n}\u0026lt;/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\nmondayThisWeek will now contain the day number of the Monday of the current week. If that Monday falls on the previous month, mondayThisWeek will be negative. Line 12 resolves that by carrying it into next week.\n\nFinally, we just loop subtracting 7 from that Monday until mondayThisWeek is less than 7 to get the first Monday of the month.\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u0026lt;code class=’objc’\u003ewhile(mondayThisWeek \u0026gt; 7) {\n    mondayThisWeek -= 7;\n}\u0026lt;/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\nAnd there you have it. mondayThisWeek (improperly named at this point) will contain the day number of the first Monday for the current month.\n\nSo, this was quite a round-a-bout way to find this value. If you have a better solution, please feel free to trash on mine in the comments 😉 .\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Case Of The Mondays\" data-url=\"http://brandontreb.com/case-of-the-mondays\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n",
  "permalink" : "https://brandon_swoop.ngrok.io/2011/02/14/office-spacejpg.jpeg/",
  "date":"2011-02-14T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2011-02-14T00:00:00Z","post_type":"article","publishdate":"2011-02-14T00:00:00Z","slug":"case-of-the-mondays","tags":["Articles"],"title":"Case Of The Mondays","type":"post"
}