{
  "name": "TagACloud.com (Re)Launched!",  
  "content": "\u003cp style=\"text-align: center;\"\u003e\n  \u003ca href=\"http://brandontreb.com/wp-content/uploads/2009/07/tagAcloud-ad1.gif\"\u003e\u003cimg class=\"size-medium wp-image-349  aligncenter\" title=\"tagAcloud-ad\" src=\"/uploads/2009/tagAcloud-ad1-500x188.gif\" alt=\"tagAcloud-ad\" width=\"500\" height=\"188\" /\u003e\u003c/a\u003e\n\u003c/p\u003e\n\n\u003cp style=\"text-align: left;\"\u003e\n  So in 2006, my buddy JJ and I took some inspiration from the \u003ca href=\"http://www.milliondollarhomepage.com/\"\u003eMillion Dollar Homepage\u003c/a\u003e and decided to create a totally inovative Web 2.0 site that works on the same principle. That is when we came up with the idea for \u003ca href=\"http://tagacloud.com\"\u003etagacloud.com\u003c/a\u003e.\n\u003c/p\u003e\n\n\u003cp style=\"text-align: left;\"\u003e\n  Tagacloud is a simple concept that uses the fact that people are obsessed with stats to make a fun game that will also direct traffic to your site. Here is how it works (from the \u003ca href=\"http://www.tagacloud.com/help/instructions\"\u003ewebsite\u003c/a\u003e)\u0026#8230;\n\u003c/p\u003e\n\n### The Idea:\n\nTagACloud is a very unique idea for a website, thus it will take a little explaining to understand all the facets. To take full advantage of the site, you must be the owner or have control over your own website. The idea is to create a tag that represents your website. A tag is a descriptive phrase or a creative tagline describing your site. Once you have added your tag, it gets added to the Tag Cloud. This is where all the fun begins.\n\n### The Goal:\n\nThe goal is simple. Become the biggest freakin’ tag on the TagACloud website. The bigger the tag, the more hits it gets. It is that simple.\n\n### How Your Tag Gets Bigger:\n\nYour tag gets bigger every time it levels up! And the only way to get your tag to level up is by accumulating points. Points can be acquired in many different ways, but the two primary ways to acquire points are as follows:\n\n  1. Get Clicked: your tag gets 1 point for every click that your tag receives.\n  2. Incoming Hits: your tag gets 2 points for every hit you send to your tag on TagACloud.com. You can get tag specific code via your “Get Tag Code” page.\n\n### How Your Tag Gets Hits\n\nWe provide visitors several ways to find your tag:\n\n  1. The Home Page: The home page features 200 random tags in random order.\n  2. Popular Tags: If your tag is one of the 200 most popular today, the last 7 days, last month, or of all time; it will be featured in order of popularity on the applicable page.\n  3. Keywords: Keywords are essential for any tag that wants to generate hits. Keywords are like user defined categories. We combine all the tags that share common keywords. For example, google.com, yahoo.com, and vanillasasquatch.com would all share the keyword, SearchEngine. Each tag can have up to 3 keywords associated with it.\n  4. The Randomizer: The title says it all. A user can view a random tag’s website, or view a random keyword.\n\n### Statistics\n\nThere are 3 big addictions on the web. Without sharing the top 2, we will let you know #3, is statistics. People love to view the stats on anything and everything. Here at TagACloud, we will make sure not to disappoint. You will be able to view statistics for every little thing, to ensure that you always know the current state of your tag. You will also find the website itself is littered with stats. Just keep your eyes open.  \n[\u003cimg class=\"alignnone\" title=\"tagacloud\" src=\"../wp-content/uploads/2009/07/tagacloud.jpg\" alt=\"tagacloud\" width=\"400\" height=\"360\" /\u003e][1]\n\nAs of late 2007, Tagacloud was booming with over **10,000 users**. Then, one day JJ and I decided we would take a weekend and \u0026#8220;improve\u0026#8221; tagacloud. Now, if any of you are programmers, you know \u0026#8220;improving\u0026#8221; an app takes much longer than you anticipate.\n\nWe set out to do it in a weekend and the ideas started flowing. It was Facebook meets Halo 3 meets Digg meets Hannah Montanna meets Karate Kid 3\u0026#8230; And then the weekend ended and Tagacloud would remain a \u0026#8220;Coming Soon\u0026#8221; page for a year and a half\u0026#8230; \u003cimg src=\"http://brandontreb.com/wp-includes/images/smilies/frownie.png\" alt=\":(\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /\u003e\n\nA couple of weeks ago, JJ and I were sitting around and thought to ourselves \u0026#8220;Why did we ever take down the old tagacloud?\u0026#8221;. One thing led to another and we decided to completely wipe the database and start tagacloud fresh.\n\nSo, go fourth and start [leveling your tag][2].\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"TagACloud.com (Re)Launched!\" data-url=\"http://brandontreb.com/tagacloud-com-relaunched\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n\n [1]: ../wp-content/uploads/2009/07/tagacloud.jpg\n [2]: http://tagacloud.com\n",
  "permalink" : "https://brandontreb.ngrok.io/2009/07/22/tagacloud-ad1-500x188.gif/",
  "date":"2009-07-22T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2009-07-22T00:00:00Z","post_type":"article","publishdate":"2009-07-22T00:00:00Z","slug":"tagacloud-com-relaunched","tags":["Articles"],"title":"TagACloud.com (Re)Launched!","type":"post"
}