{
  "name": "Free Business Idea: RV Storage \u0026 Rental",  
  "content": "I was having a conversation with my dad the other day and sharing some of my current business ideas with him.  I also mentioned that I often discuss new product/business ideas in public with other people.\n\nHis response was obviously “Why would you just give away your ideas?”.  I then proceeded to give him the \u0026quot;Your Ideas Are Worthless Without Proper Execution” spiel.  \n\nSo, to put my money where my mouth is, I will be sharing my business ideas here; putting them out there in hopes that either a. I get valuable feedback/encouragement or b. someone else builds it and I get to use it. \n\n**Business idea**\n\nSo many people have RVs that are in use roughly 5% on the year.  The other 95% of the time, they sit in disrepair and usually cost the owner money to store them.\n\nWhile many sites like [RVShare](https://rvshare.com/) exist that allow you to essentially \u0026quot;rent out\u0026quot; your RV, they still pose a huge challenge in that the RV must be physically located on the owner\u0026#39;s property.   \n\nI propose to build an RV storage facility where owners receive the following:\n\n1. Free Storage\n2. Free basic upkeep\n3. Free cleaning\n4. Profit Sharing\n5. Insurance\n\nIn exchange for this, they allow us to rent their RV out at a price we set.  It would function much like RVShare in that would-be RVers reserve one of the RVs we have in our fleet and come pick it up. The RV would be ready to go with a full tank of water, full propane tanks, and a generator.\n\nOnce they return the RV, it gets cleaned and prepped for the next renter. Profits from the rental would be shared with the RV owner.\n\nThere you have it. I\u0026#39;d love to [hear your thoughts](http://twitter.com/brandontreb) and I hope to be sharing more of these in the future.\n\n",
  "permalink" : "https://brandontreb.ngrok.io/2018/11/13/free-business-idea-rv-storage/",
  "date":"2018-11-13T21:18:24Z","draft":false,"iscjklanguage":false,"lastmod":"2018-11-13T21:18:24Z","post_type":"article","publishdate":"2018-11-13T21:18:24Z","slug":"free-business-idea-rv-storage","title":"Free Business Idea: RV Storage \u0026 Rental","type":"post"
}