{
  "name": "Idea: Micropub Browser Extension For Replies!!!!!!!",  
  "content": "I LOVE finding sites that support [webmentions](https://indieweb.org/Webmention). For me, it's an instant subscribe.  These are people who are looking to build community on the web in a new way.\r\n\r\nThe process of \"replying\" and sending a webmention to a post is *still* a bit cumbersome.  Here are the current steps:\r\n\r\n1. Read an article that I want to respond to\r\n2. Determine if the article supports webmentions (either they offer a URL box OR you have to view the source to see if they have a webmention endpoint).\r\n3. Copy the URL\r\n4. Paste the URL into the \"reply box\" in something like [Quill](https://ll.p3k.io)\r\n5. Write your reply\r\n\r\nIt _works_, but it's not ideal.  Also, the average user is not going to go through the trouble of doing all of this. \r\n\r\n_\"There must be a better way...\"_\r\n\r\n### Solution\r\n\r\nI am proposing a brower extension that you would authenticate with your [micropub](https://indieweb.org/Micropub) endpoint using [IndieAuth](https://indieauth.com/).  Once authenticated, the steps to reply to a post become as followed:\r\n\r\n1. If the site supports webmentions, the plugin will have an active icon\r\n2. Click the icon to reveal a text box\r\n3. Type your response and click send\r\n\r\n(behind the scenes, the extension posts the reply to your blog and then sends a webmention to the URL you are replying to)\r\n\r\nThis would greatly reduce the friction of using webmentions for responses to posts and I believe would further the adoption of this technology.  \r\n\r\nMaybe I will get around to building this someday...\r\n\r\nLet me know what you think by sending me a webmention ;)\r\n\r\nfoo\r\n",
  "permalink" : "https://brandontreb.ngrok.io/2023/03/03/i8hohphoqfnoaujhlbgtm/",
  "date":"2023-03-03T00:42:01.921Z","draft":false,"iscjklanguage":false,"lastmod":"2023-03-03T00:42:01.921Z","post_type":"article","publishdate":"2023-03-03T00:42:01.921Z","slug":"i8hohphoqfnoaujhlbgtm","tags":["indieweb","ideas","webmention","micropub"],"title":"Idea: Micropub Browser Extension For Replies!!!!!!!","type":"post"
}