{
  "name": "Ship Products You Are Proud Of",  
  "content": "There is a familiar phrase that I hear all too often when a client comes to me with an existing application.  It goes something like this:\n\n\u0026#8220;Our team spent quite a bit of money on our application and we don’t want to ship it.  **We are** **not proud of the product**.\u0026#8221;\n\nIt blows my mind that many developers and development teams are still in business given the poor quality of products that I see getting churned out all of the time.\n\nWhen I encounter these types of situations, I immediately know that the team (or individual) behind them is much more interested in a ‘quick buck’ instead of the longevity of their company.  Poor quality in software is directly related to cutting corners.\n\nA few examples of cut corners:\n\n  1. *Using inexperience developers without proper guidance*.  I am all for hiring ‘staff’ level developers, however, they must be properly mentored and trained so that there is no compromise on quality.  If you must compromise on something, compromise it on *time*.\n  2. *Outsourcing the project without proper guidance*.  Although I don’t prefer outsourcing given the communication challenges, I am not opposed to it.  There are plenty of talented individuals all over the world.  However, given the varying degree of abilities and communication issues, one must not rely 100% on an outsourced team to ship a product.\n  3. *Not following coding standards/guidelines.*  This could be things such as: not commenting code, not testing, not leveraging a QA team, or simply writing “smoke an mirror” code.\n\nI can usually identify immediately which of the above applies after spending a few minutes with the code.  In fact, I have built much of [my business][1] around saving these types of projects.\n\nSo I urge you, although it might cut into my market share, *please *build something you are proud of.  This is not only the right thing to do, it is also **critical **to your future success as an independant software developer.\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Ship Products You Are Proud Of\" data-url=\"http://brandontreb.com/ship-products-you-are-proud-of\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n\n [1]: http://pixegon.com\n",
  "permalink" : "https://brandontreb.ngrok.io/2015/04/07/ship-products-you-are-proud-of/",
  "date":"2015-04-07T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2015-04-07T00:00:00Z","post_type":"article","publishdate":"2015-04-07T00:00:00Z","slug":"ship-products-you-are-proud-of","tags":["consulting","featured","business","proud","ship"],"title":"Ship Products You Are Proud Of","type":"post"
}