{
  "name": "Game Dev Challenge + OpenGL ES Resource List",  
  "content": "The other day, I was reading [Ludum Dare][1] and saw a very interesting post. It was a call to action for all game developers to get serious and actually put something out there. Here is a link to the post:\n\n\u003ca title=\"Permanent Link: PoV’s Challenge: Make a game, sell 1 copy\" rel=\"bookmark\" href=\"http://www.ludumdare.com/compo/2010/09/22/povs-challenge-make-a-game-sell-1-copy/\"\u003ePoV’s Challenge: Make a game, sell 1 copy\u003c/a\u003e\n\nThe idea is for would-be indie game developers to create a game in the month of October and sell at least **one copy**. There are no judges, it\u0026#8217;s not a competition with anyone other than yourself. According to PoV from Ludum Dare:\n\n\u003e Think of this as a race (or a [Nanowrimo][2] for games+business). Have something **new** for sale and in a store by the end of October. And if you can sell a copy (or sign a licensing deal, or earn $1 in ad revenue), **\u003cspan style=\"text-decoration: underline;\"\u003eyou win\u003c/span\u003e**.\n\nI have been attempting to learn OpenGL since my early days of programming 10 years ago and it has never stuck. I figured this would be a perfect opportunity to really buckle down and learn it. Recently, I have stumbled upon some really great **OpenGL ES resources and tutorials **that have really made things \u0026#8220;click\u0026#8221; for me. I wanted to share them in this post.\n\n## 1. OpenGL ES From The Ground Up\n\n\u003cimg class=\"alignleft\" title=\"iphone developement - opengl es\" src=\"http://lh5.ggpht.com/_QLwms0mVa4w/SfpuxUUtxaI/AAAAAAAAATA/0cCN7dX_6Q4/colorico.jpg?imgmax=800\" alt=\"\" width=\"100\" height=\"192\" /\u003eURL: \u003chttp://iphonedevelopment.blogspot.com/2009/05/opengl-es-from-ground-up-table-of.html\u003e\n\nThis is a blog created by Apress author Jeff Lamarche. Jeff has been blogging about opengl es for quite some time and probably has one of the best opengl series out there. His tutorials are aimed at the absolute beginner and he takes a very nice approach to teaching OpenGL ES.\n\nThe link above will take you to his table of contents of tutorials. Where you can read up on his articles ranging from drawing basic triangles to importing 3D models from Blender.  \n_\n\n## 2. Simon Maurice iPhone OpenGL ES\n\n[\u003cimg class=\"alignleft size-full wp-image-950\" title=\"3dimage\" src=\"/uploads/2010/3dimage.jpg\" alt=\"\" width=\"122\" height=\"162\" /\u003e][3]URL: [http://www.cocoachina.com/wiki/index.php?title=Category:Simon\\_Maurice\\_iPhone\\_OpenGL\\_ES][4]\n\nThis is an incredible 20 part series that was translated from Chinese to English and posted on the CocoaChina Wiki. These articles take a slightly different approach, while still doing a great job of teaching you OpenGL ES.\n\nThe articles are well written and quite comprehensive. It is obvious that the approach isn\u0026#8217;t quite as professional as Jeff Lamarche\u0026#8217;s blog, however this series goes a lot more in depth and will teach you more complex concepts such as handling touch and **moving in 3D**.\n\n### 3. NeHe OpenGL Tutorials\n\nURL : \u003chttp://nehe.gamedev.net/lesson.asp?index=01\u003e\n\n\u003cimg class=\"alignleft\" title=\"neho\" src=\"http://nehe.gamedev.net/data/lessons/lesson05.jpg\" alt=\"\" width=\"168\" height=\"126\" /\u003eThese are oldies but goodies. The NeHe tutorials have been around for years and years. In fact, I attempted to understand them in my early days of coding when I declared every method as static in Java so I didn\u0026#8217;t have to instantiate the class to call it (fail). Either way, these tutorials are a staple in the Open GL community.\n\nAlthough they are not written for ES, they still provide some solid OpenGL concepts. I would strongly suggest reading these after you have read through the other 2. There are some limitation of OpenGL ES (like not supporting GL_QUADS), that will quickly confuse you if you try to write the Nehe tutorials on the iPhone.\n\nOne killer thing about the first link I mentioned is, Jeff Lamarche actually ported the first 6 Nehe tutorials to the iPhone and they can be found on the page I linked to.\n\nI will be studying these resources carefully over the coming month. I intend to take the plunge and developer a simple OpenGL ES game in the month of October and **sell 1 copy**.\n\nSo, please join me! If you decide to do this and are journaling your progress, link your blog in the comments. I would love to follow it. I will be doing the same here.\n\nHappy Coding!\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Game Dev Challenge + OpenGL ES Resource List\" data-url=\"http://brandontreb.com/game-dev-challenge-opengl-es-resource-list\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n\n [1]: http://www.ludumdare.com/\n [2]: http://www.nanowrimo.com/\n [3]: /uploads/2010/3dimage.jpg\n [4]: http://www.cocoachina.com/wiki/index.php?title=Category:Simon_Maurice_iPhone_OpenGL_ES\n",
  "permalink" : "https://brandontreb.ngrok.io/2010/09/30/3dimage.jpg/",
  "date":"2010-09-30T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2010-09-30T00:00:00Z","post_type":"article","publishdate":"2010-09-30T00:00:00Z","slug":"game-dev-challenge-opengl-es-resource-list","tags":["iPhone"],"title":"Game Dev Challenge + OpenGL ES Resource List","type":"post"
}