{
  "name": "Client Deliveries Are Hard",  
  "content": "I have been building software for clients for over a decade now and have come to one solid conclusion: **deliveries suck**.\n\nMaybe I\u0026#39;m just the worst developer in the world and have worked with the worst teams and have had the worst clients… but I doubt it.\n\nI have delivered early, on time, late, with more functionality, exactly the same, and in some cases less functionality (usually due to lack of funding) and still…rough deliveries. \n\nWhen I say “rough deliveries”, I usually mean angry clients and stressed out developers.  Maybe not angry like the hulk (though I have seen it), but at the very least, passive aggressive comments,  notes of disappointment, etc…\n\nThe reason deliveries are hard is because of a misalignment of expectations.  When a client has an idea in their head of how their product should look/feel/function and it\u0026#39;s been burning in their mind forever, us developers are doomed from the get go.  We can never deliver perfectly to match this magic piece of software that only exists in our client\u0026#39;s mind.\n\nAlso, software is hard. It\u0026#39;s especially hard to get exactly right on the very first pass. Software is a living and breathing entity that needs lots of care and feeding. It\u0026#39;s very tricky to articulate this to someone who doesn\u0026#39;t understand that and is paying you 10\u0026#39;s of thousands of dollars to build their dream.\n\nWe follow a pretty strict agile process, so the client usually sees their build at every...single...stage.  They also have full control to report issues, make changes, etc… during the build cycle. Still, for some reason, they are always dumbfounded when it comes time to ship.\n\nSo, if you are building for clients, cut yourself some slack.  Know that deliveries will be tough and most of the time, there is nothing you can do to prevent that.\n\n",
  "permalink" : "https://brandontreb.ngrok.io/2018/11/14/client-deliveries-are-hard/",
  "date":"2018-11-14T23:04:32Z","draft":false,"iscjklanguage":false,"lastmod":"2018-11-14T23:04:32Z","post_type":"article","publishdate":"2018-11-14T23:04:32Z","slug":"client-deliveries-are-hard","tags":["consulting","featured","programming"],"title":"Client Deliveries Are Hard","type":"post"
}