{
  "name": "2016 Goals",  
  "content": "As the new year kicks off in full swing, I am reflecting on \u003ca href=\"http://brandontreb.com/goals-for-2015/\"\u003emy 2015 goals\u003c/a\u003e and setting some new ones for 2016.\n\nHere is how I did on each of last year's goals:\n\u003cul\u003e\n    \u003cli\u003e\u003cstrong\u003eCreate a business plan\u003c/strong\u003e - \u003cspan style=\"color: #993300;\"\u003eFail\u003c/span\u003e. I did not create a business plan for Pixegon.  This might have to carry over.\u003c/li\u003e\n    \u003cli\u003e\u003cstrong\u003eGrow Pixegon (my mobile consultancy) to 2x 2014 revenue\u003c/strong\u003e - \u003cspan style=\"color: #008000;\"\u003eSuccess\u003c/span\u003e. We not only achieved this goal, but surpassed it. Pixegon did a total of $1.1mm in revenue in 2015!\u003c/li\u003e\n    \u003cli\u003e\u003cstrong\u003eHire a “director” - \u003c/strong\u003e\u003cspan style=\"color: #008000;\"\u003eSuccess\u003c/span\u003e. OK, so this one is sort of in the middle. I didn't quite hire a director per se, however I did elevate my senior employees to more management roles. This allows them to take some of the day to day tasks off of my plate.\u003c/li\u003e\n    \u003cli\u003e\u003cstrong\u003eMove to a weekly - \u003c/strong\u003e\u003cspan style=\"color: #993300;\"\u003eFail\u003c/span\u003e. But I'm OK with it. This isn't very important.\u003c/li\u003e\n    \u003cli\u003e\u003cstrong\u003eMorning Routine\u003c/strong\u003e - \u003cspan style=\"color: #ffcc00;\"\u003eModerate\u003c/span\u003e. Some days were better than others\u003c/li\u003e\n    \u003cli\u003e\u003cstrong\u003eBlog twice a month - \u003c/strong\u003e\u003cspan style=\"color: #993300;\"\u003eHuge Fail\u003c/span\u003e.  I averaged .41 times per month.\u003c/li\u003e\n    \u003cli\u003e\u003cstrong\u003eTake off / reduce workload - \u003c/strong\u003e\u003cspan style=\"color: #008000;\"\u003eSuccess\u003c/span\u003e. More camping!\u003c/li\u003e\n    \u003cli\u003e\u003cstrong\u003eGive away more than 10% of personal income - \u003c/strong\u003e\u003cspan style=\"color: #008000;\"\u003eSuccess\u003c/span\u003e. Our family was blessed with multiple opportunities throughout the year to be a blessing to others in addition to our normal donations.\u003c/li\u003e\n\u003c/ul\u003e\nOverall, I'd call 2015 a success. I managed to hit the goals I felt most passionate about, and more importantly, this exercise has helped me to determine what I should focus on.  With that being said here are my goals for 2016.\n\u003cul\u003e\n    \u003cli\u003e\u003cstrong\u003eProfessional\u003c/strong\u003e\n\u003cul\u003e\n    \u003cli\u003eLand \u003cstrong\u003eONE\u003c/strong\u003e new client.  Sounds crazy I know, but allow me to explain.  Pixegon has been fortunate enough to work with some \u003ca href=\"http://www.pixegon.com/more-works\"\u003epretty incredible clients\u003c/a\u003e.  Many of these clients trust us to be their primary dev team throughout the year. I intend on finding at least ONE more client like these in 2016 (Referrals welcome ;) ).\u003c/li\u003e\n    \u003cli\u003eBuild Something New. As I continue to build a company, it's often hard to get back to my roots of writing code and actually creating something. I miss this. It provided so much value to me over the course of the years. So, this year, I want build some \"side projects\".\u003c/li\u003e\n    \u003cli\u003eHire. I hope to grow the team by at least 20% this year.  (\u003ca href=\"http://www.pixegon.com/join-our-team/\"\u003eWe are always hiring most positions\u003c/a\u003e).\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n    \u003cli\u003e\u003cstrong\u003ePersonal\u003c/strong\u003e\n\u003cul\u003e\n    \u003cli\u003eBe more intentional about EVERYTHING.  I have really been into a few blogs lately (\u003ca href=\"http://www.mrmoneymustache.com\"\u003eMr Money Mustache\u003c/a\u003e, \u003ca href=\"http://www.theminimalists.com\"\u003eThe Minimalists\u003c/a\u003e, \u003ca href=\"http://fourhourworkweek.com/blog/\"\u003e4-Hour Workweek\u003c/a\u003e, etc...).  What I have really learned is that I want to be more intentional about everything I do (Family, Time, Money, etc...).  Part of this is removing my dependency on my phone, simplifying my life, and scheduling undivided time for the things that are important.\u003c/li\u003e\n    \u003cli\u003eStop Complaining. I read this incredible book called \u003ca href=\"http://www.amazon.com/gp/product/0770436390/ref=as_li_tl?ie=UTF8\u0026amp;camp=1789\u0026amp;creative=9325\u0026amp;creativeASIN=0770436390\u0026amp;linkCode=as2\u0026amp;tag=codnerandnon-20\u0026amp;linkId=JCWEFBN6BTYDX2OC\" rel=\"nofollow\"\u003eA Complaint Free World\u003c/a\u003e . He talks about the power of Not complaining. This has really resonated with me.\u003c/li\u003e\n    \u003cli\u003eBlog Twice Per Month. OK This time I mean it (1 down, 23 to go! )\u003c/li\u003e\n    \u003cli\u003eRead 5 books. Arbitrary amount I know, but I need something measurable.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\nThat's it. Here's to a healthy and productive 2016!\n\nFeel free to link me to your 2016 goals blog posts in the comments.\n\n",
  "permalink" : "https://brandontreb.ngrok.io/2016/01/11/goals-2016/",
  "date":"2016-01-11T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2016-01-11T00:00:00Z","post_type":"article","publishdate":"2016-01-11T00:00:00Z","slug":"goals-2016","tags":["consulting"],"title":"2016 Goals","type":"post"
}