{
  "name": "Pixel Art Character Tutorial \u0026#8211; Creating And Customizing A Bitizen",  
  "content": "\u003ccenter\u003e\n  \u003cimg src=\"http://f.cl.ly/items/1R171P3K050O2m1H210C/Toy-Story-brandontreb.com.png\" /\u003e\n\u003c/center\u003e\n\n\n\nThis will be a continuation of my last pixel art tutorial about [configuring Photoshop for Pixel Art][1]. For the past month or so, both my wife an I have been pretty addicted to this amazing game called [Tiny Tower][2] created by [Nimble Bits][3]. The biggest draw for me to this game isn\u0026#8217;t the fact that it has great simulation style game mechanics, it\u0026#8217;s the fact that it was created using **Pixel Art**.\n\nAs I mentioned in my other post, I have a serious passion for pixel art and have been doing everything I can to learn about it and improve my skills. One great thing about it is, **anyone can do it**. You don\u0026#8217;t have to be this amazing artist to be able to create interesting pixel art.\n\n#### Getting Started\n\nThey say that imitation is the best form of flattery, so we are going to flatter the heck out of the Nimble Bits guys are learn how to make our own Bitizen characters from Tiny Tower. I have found that a good starting place for learning pixel art (or anything really), is to start with something that already exists, copy it, then modify it. Once you do that a few times and get comfortable, then you should have the confidence to branch out into creating your own artwork.\n\nWhen creating a game (or complex piece of pixel artwork) that involves a ton of different characters, it will save a ton of time and energy if you create a \u0026#8220;base character\u0026#8221;. What I mean by \u0026#8220;base character\u0026#8221; is one that is very bland and plain. Something that is easily customizable. So, that\u0026#8217;s what this tutorial is about, we are going to create a bland white guy for Tiny Tower.\n\nOne thing I want to point out before we start is, I have lowered the resolution of the character a bit and am not putting in as much detail as the Nimble Bits team. This is just for simplicity\u0026#8217;s sake in order to get my point across and make things easier on you.\n\n#### New Document\n\nStart out by creating a 15x25px document. I know, it\u0026#8217;s very small, but we don\u0026#8217;t need much. Make sure you have Photoshop [configured][1] for pixel art. At this point, I\u0026#8217;d suggest creating all of the layers for your bitizen. **Why use layers?** you might ask. Great question. Well, in order to quickly modify our base character, we want to have a separate layer for each of his features/body parts. So, create the following layers.\n\n  * Head\n  * Mouth\n  * Hair\n  * Eyes\n  * Shirt\n  * Pants\n  * Feet\n  * Arms\n\nNow, you can confidently modify any part of your Bitizen without the risk of destroying the rest. As I reference each part below, make sure you switch to the correct layer when drawing.\n\n#### Creating The Head\n\nThe head is perhaps the most complicated part of the Bitizen due to its odd shape and shading. The shape is due to the fact that the Bitizen is always looking in the forward direction.\n\nStart with a skin tone color (I have used #f7e0c2) and create a 10 x 6 rectangle in the center of your view like this:\n\n![Bitizen head][4]\n\nNow, that the base head is in place, it\u0026#8217;s time to draw the chin and neck. With the same color, indent one pixel in on the bottom and draw straight across. Finally, indent 3 more pixels in, and draw 4 pixels across. This is what your head should look like at this point.\n\n![Head and Chin][5]\n\n**Shading**\n\nShading with pixel art is simply a matter of drawing with a darker shade of your main color. With the color chooser in PS and the skin tone still selected, drag the color down to a slightly darker shade and lowlight a 1 pixel line on the right side of the face. In our example the Bitizen is looking to his right, so his left will be shaded.\n\nThen, add some more shading as you see necessary. If you look at mine, I have used a bit of shading to extend the head a little bit.\n\n![Head Shading][6]\n\n**Hair, Mouth And Eyes**\n\nThe mouth and eyes are very simple with our Bitizens. The eyes are just single black pixels and the mouth is just a 4 pixel line using a darker shade of the skin tone.\n\nHair can be whatever you like. I have chosen a very simple hairstyle that you see quite often in the game with a simple shade of brown. I have also applied the same shading technique to the hair that I did to the face and neck. When you are finished, it should really start looking like a person.\n\n![Hair and eyes][7]\n\n#### Creating The Body, Legs and Feet\n\nFor the body, start with 6 x 5 rectangle set to the color that you want to make the shirt. I chose #63cfea. For the pants, simply draw a solid line. Finally, the feet are just two 2px lines spread apart by two more pixels. If you notice in the game, to animate the movement of these guys, they simply alternate between this position and a centered 4px line. It just goes to show you how much things can be simplified when you use pixel art.\n\n![Body and legs][8]\n\nTo finish up our Bitizen, we add single pixel dots for hands and a couple pixels for arms. After that, we add a collar and some simple shading.\n\nHere is what the completed Bitizen looks like:\n\n![Completed Bitizen][9]\n\n#### Conclusion\n\nThe one thing to remember when creating pixel art for game is to keep it simple. Simplify everything. Take for example the Toy Story characters I made at the top of this post. They are *very* simplistic yet you recognize who they are right away. My 2.5 year old son was yelling \u0026#8220;Woody! Buzz!\u0026#8221; the entire time I was creating them. I think this is one of the largest challenges; sticking to \u0026#8220;less is more\u0026#8221;.\n\nThere are some other fun things we can do to customize these guys. We can even do it in code! Next time, I will show you how to take a \u0026#8220;base character\u0026#8221; and customize its colors using Cocos 2D. This can save you even more time and energy when trying to make dynamic characters for your game.\n\nIf you are feeling lazy and want to simply download my bitizen base, click the following link:\n\n[Download my bitizen.psd template][10]\n\nOn a final note, **don\u0026#8217;t just copy these guys for YOUR game**! I know it might seem tempting to give em a different shirt and plop them in your super rad fart machine RPG, but these guys are the product of the hard work of the guys at Nimble Bits.\n\nIf you have any questions or tips, please feel free to leave them in the comments.\n\nI would also **LOVE** to see some of the custom bitizens you guys come up with. Please link to them in the comments if you end up creating some.\n\nHappy Coding!\n\n\u003cspan style=\"font-family: ‘Lucida Grande’;\"\u003e\u003cstrong\u003e\u003cspan style=\"font-weight: normal;\"\u003e\u003cspan style=\"font-family: arial, verdana, tahoma, sans-serif; font-size: 13px; line-height: 20px;\"\u003e\u003cem\u003e﻿﻿This post is part of \u003ca style=\"text-decoration: none; color: #004199; padding: 0px; margin: 0px;\" href=\"http://idevblogaday.com/\"\u003eiDevBlogADay\u003c/a\u003e, a group of indie iOS development blogs featuring two posts per day. You can keep up with iDevBlogADay through the \u003ca style=\"text-decoration: none; color: #004199; padding: 0px; margin: 0px;\" href=\"http://idevblogaday.com/\"\u003eweb site\u003c/a\u003e, \u003ca style=\"text-decoration: none; color: #004199; padding: 0px; margin: 0px;\" href=\"http://feeds.feedburner.com/idevblogaday\"\u003eRSS feed\u003c/a\u003e, or \u003ca style=\"text-decoration: none; color: #004199; padding: 0px; margin: 0px;\" href=\"http://twitter.com/#search?q=%23idevblogaday\"\u003eTwitter\u003c/a\u003e.\u003c/em\u003e\u003c/span\u003e\u003c/span\u003e\u003c/strong\u003e\u003c/span\u003e\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Pixel Art Character Tutorial - Creating And Customizing A Bitizen\" data-url=\"http://brandontreb.com/pixel-art-character-tutorial-creating-and-customizing-a-bitizen\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n\n [1]: http://brandontreb.com/Configuring-Photoshop-For-Pixel-Art\n [2]: http://itunes.apple.com/us/app/tiny-tower/id422667065?mt=8\n [3]: http://nimblebit.com/\n [4]: http://f.cl.ly/items/211O2O1P37131Q2m2Z2P/Screen%20shot%202011-07-16%20at%201.22.24%20PM.png\n [5]: http://f.cl.ly/items/401p2x3t1d1B2n2A1W0Y/Screen%20shot%202011-07-16%20at%201.25.11%20PM.png\n [6]: http://f.cl.ly/items/3y3z2Z1n3f0d3T1h3Q46/Screen%20shot%202011-07-16%20at%201.31.16%20PM.png\n [7]: http://f.cl.ly/items/2n181w081O20042v3U0g/Screen%20shot%202011-07-16%20at%201.35.22%20PM.png\n [8]: http://f.cl.ly/items/3B203J0j2R3T0p0s3r39/Screen%20shot%202011-07-16%20at%201.43.55%20PM.png\n [9]: http://f.cl.ly/items/0M1F0I0O0F3q3E2n3w0I/Screen%20shot%202011-07-16%20at%201.51.49%20PM.png\n [10]: http://cl.ly/2u3h0g2F2H2b1S280519/bitizen.psd\n",
  "permalink" : "https://brandon_swoop.ngrok.io/2011/07/16/pixel-art-character-tutorial-creating-and-customizing-a-bitizen/",
  "date":"2011-07-16T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2011-07-16T00:00:00Z","post_type":"article","publishdate":"2011-07-16T00:00:00Z","slug":"pixel-art-character-tutorial-creating-and-customizing-a-bitizen","tags":["Articles"],"title":"Pixel Art Character Tutorial \u0026#8211; Creating And Customizing A Bitizen","type":"post"
}