{
  "name": "Side Projects",  
  "content": "Over at [Pixegon](http://pixegon.com), I really try to encourage my developers to have their own side projects.  Often times, employers look at side projects as competition and try to own the works that their developers produce.  Some will even go as far as to include this in their employee handbooks.  \n\nIn my opinion, this stifles creativity and creates a feeling of contention between the employee and company.  \n\nPeople start side projects all of the time for a variety of reasons:\n\n- To make some extra cash\n- To learn a new technology \n- To sharpen one's skills \n- Just for fun\n\nFrom an employer's standpoint, these are all **great**. It allows my developers the freedom to learn new things, make mistakes, and even earn extra cash. All without me fronting the cost. \n\nWhile this might now sound selfish, it's obviously a two-way street. Developers greatly benefit from this type of arrangement.\n\n### Getting started with a side project\n\nThis is one I struggle with all of the time.  Sometimes it's a motivation issue, sometimes I lack an idea, and sometimes I'm just feeling lazy and end up reading Hacker News instead due to my analysis paralysis.  \n\nThe best bet is to just **start**. Whether your idea is big or small, stupid or world changing, just start writing some code. I try to utilize this tactic in all areas of my life from code, to writing, to working out, to minimizing, and even saving money.  Once you get some momentum going, you will quickly find out what's working and what's not. \n\nHere are a few Hacker News Posts that I found particularly inspiring to get you started:\n\n- [How To Ship Side Projects](http://blog.andyjiang.com/how-to-ship-side-projects/)\n- [Those making $1,000+/month on side projects – what did you make?](https://news.ycombinator.com/item?id=8844083) (similar posts below)\n\t- [https://news.ycombinator.com/item?id=12670731](https://news.ycombinator.com/item?id=12670731)\n\t- [https://news.ycombinator.com/item?id=8800788](https://news.ycombinator.com/item?id=8800788)\n\t- [https://news.ycombinator.com/item?id=11898992](https://news.ycombinator.com/item?id=11898992)\n- [Epic List of Side Project Ideas for Programmers](http://livingliferichly.com/epic-list-of-side-project-ideas-for-programmers/)\n- [Ask HN: Where do you get ideas to build side-projects?](https://news.ycombinator.com/item?id=5234692)\n\nDont' have any idea to start on? Try cloning something in one of the above posts. There are _tons_ of ideas in here large and small and there's plenty of room on the web for variances of differenct products. I probably stole most of this post from somewhere...\n\nIf you found this post helpful and want to hear more, make sure to [subscribe to my newsletter](http://brandontreb.us3.list-manage1.com/subscribe?u=66135759856eefe4f6dcec97c\u0026id=ef6c358d78). It's not spammy, just let's you know when I post.\n",
  "permalink" : "https://brandon_swoop.ngrok.io/2017/02/06/sideprojects/",
  "date":"2017-02-06T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2017-02-06T00:00:00Z","post_type":"article","publishdate":"2017-02-06T00:00:00Z","slug":"sideprojects","title":"Side Projects","type":"post"
}