{
  "name": "Blogging Practices \u0026#8211; Frequency and Size of Posts",  
  "content": "If you have ever had your own blog, you may have at one point been faced with a question. How often should I write a blog post and how long should each post be?\n\nI have been thinking about this since I started blogging. It is a common thought that you must write a post every single day in order to increase/maintain traffic. But, is this really true? For busy people with families and lives (that aren\u0026#8217;t blogging) might have a tough time writing a new content-rich post every single day.\n\nSo, would readers rather see less frequent but \u0026#8220;better\u0026#8221; blog posts or more frequent \u0026#8220;weaker\u0026#8221; blog posts? Or maybe even a combo of the two?\n\nFor example, what if between killer programming tutorials, I wrote short posts about my dog or response to popular articles. Would this benefit my readers or turn them off?\n\nI don\u0026#8217;t have a real solution to this but plan to employ some of these strategies while writing this blog. Hopefully, I will be able to draw some conclusions and share them. If you happen to stumble on this post on your journey through the interwebz, please feel free to comment and shed some light on this for me.\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Blogging Practices - Frequency and Size of Posts\" data-url=\"http://brandontreb.com/blogging-practices-frequency-and-size-of-posts\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n",
  "permalink" : "https://brandontreb.ngrok.io/2009/02/18/blogging-practices-frequency-and-size-of-posts/",
  "date":"2009-02-18T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2009-02-18T00:00:00Z","post_type":"article","publishdate":"2009-02-18T00:00:00Z","slug":"blogging-practices-frequency-and-size-of-posts","tags":["Articles"],"title":"Blogging Practices \u0026#8211; Frequency and Size of Posts","type":"post"
}