{
  "name": "What I Learned In My First Year Of iOS Consulting",  
  "content": "Wow, I can\u0026#8217;t believe it has already been a full year since I struck it out on my own.  Last year, I [published a post][1] after my first month on doing contract iOS development.  Needless to say, I have grown and learned quite a bit over the past year and I wanted to share some of those experiences.\n\n### Income\n\nWhile I won\u0026#8217;t share exact numbers, I left my 6 figure/year job to pursue the indie/consulting life.  During the course of the year, I was able to amass 40% more income in 2013 than I had at my previous position.\n\nIn addition to that, I had the time to launch a couple iOS applications and thus upping my Apple income by about 20% this year.\n\n### Network Network Network\n\nI would say spending time networking and meeting people is just as important as being able to write code if you want to be successful on your own.  Through out the year, I dedicated at least five to ten hours a week just meeting with people, talking on the phone, and making new connections.\n\nOften times, I would get contract opportunities that I knew for sure that I wasn\u0026#8217;t going to take; either because I didn\u0026#8217;t love the project, or (more often than not) because I didn\u0026#8217;t have the bandwidth to take them on.  However, rather than just writing the client back \u0026#8220;*I don\u0026#8217;t have time*\u0026#8220;, I would take the call (or meeting in town), make the connection, and even listen to details about the contract.\n\nMy wife would tell me to stop wasting my time and that those hours would be better spent on project work that actually made money.  However, these contacts are arguably **more** valuable than the hours \u0026#8220;lost\u0026#8221;.  In many situations, I have reached out to those potential clients weeks or months later once I hired a new developer and was then able signed a contract.  If I had declined the meeting to begin with, they probably wouldn\u0026#8217;t have been as inclined to work with me so readily.\n\n### **Subcontractors**\n\nSubcontracting has been a mixed bag for me.  \u003cspan style=\"line-height: 1.714285714; font-size: 1rem;\"\u003eIt seems to be the only (safe-ish) way to expand your business as a consultant, other than hiring full time developers.  So, if you want to be able to work less yourself (which is almost never the case) or increase your companies revenue, you need to hire out.  \u003c/span\u003e\n\nOnce I found the right people, subcontracting was a dream.  I was able to reach more clients, still deliver the same value in the work, and achieve the client\u0026#8217;s goals, all while expanding my business.\n\nThe main challenge I have had is deciding whether to hire subcontractors from here in the states or \u0026#8220;offshore\u0026#8221;.  They both have their benefits and complications. Here are some I have found:\n\n**Benefits of hiring in the states:**\n\n  * Communication \u0026#8211; Most of the time their timezones are close enough that one of you is not inconvenienced to communicate in real time.\n  * Trust From Clients \u0026#8211; Some clients still have some issues with \u0026#8220;offshore\u0026#8221;, especially because many of them have tried their hand at the ODesk lottery and have lost.  So, saying you have US based team members sometimes makes them more comfortable. It\u0026#8217;s unfortunate, but I have seen it to be true in some cases.\n  * Colleagues \u0026#8211; Often times you already know or have worked with these guys since starting with acquaintances/friends is a good place to look for developers.\n\n**Complications hiring in the states**\n\n  * Cost \u0026#8211; US devs are expensive.  Most of the time they have full time jobs and want to do consulting on the side.  So it is important that they get paid more to do contract work than their day job pays.\n  * Colleagues \u0026#8211; This is on the negative list as well because hiring people you know can get weird if things go awry.\n\n**Benefit of Offshore developers **\n\n  * Cost \u0026#8211; I put this here, however that doesn\u0026#8217;t mean I hire \u0026#8220;cheap\u0026#8221; developers.  Honestly, if you are not paying a contractor well, you are either under paying him and should give him a raise OR he shouldn\u0026#8217;t be working for you as he\u0026#8217;s probably too junior.\n  * Perspective \u0026#8211; I have some incredible developers in other countries that have taught me quite a bit whether it\u0026#8217;s about development, process, culture, or even my own code.  It\u0026#8217;s a great opportunity to learn.\n\n**Problems with Offshore developers **\n\n  * Location \u0026#8211; Timezone issues *can* be a problem if you let them.  For example, I have a developer who lives in a completely different timezone than my own.  However, he does a fantastic job of being available when he is needed.  I have had other instances where it was very challenging to reach my developer in an event where I needed information on short notice.\n  * Vetting Process \u0026#8211; Finding developers is a little more tricky.  With devs in the states, you can just head to a local meet up or conference, but finding GOOD \u0026#8220;offshore\u0026#8221; devs is a little trickier.  I have lucked out a few times, but for the most part it\u0026#8217;s a bit more work.  I would suggest spending a little of your own money to adequately search and vet each candidate.\n  * Language \u0026#8211; While doing iOS development, you may need your client and your developer to communicate with one another.  That being said, it\u0026#8217;s vital to find a developer who *you* can understand and who can understand you in order to make communication possible.\n\n### Hiring An Assistant\n\nTaking a page from Tim Ferris\u0026#8217; *4 Hour Work Week*, I decided to hire an assistant.  Ferris suggests \u0026#8220;virtual\u0026#8221;, however, I have hired one locally (she\u0026#8217;ll be proofreading this post 😉 ).  I think it\u0026#8217;s one of the best decisions I have made as a business owner.  Here is just a short list of things she handles for me:\n\n  * Contracts\n  * Invoicing\n  * Payments of contractors\n  * Research\n  * Phone calls\n  * Personal issues (like returns, purchasing equipment, etc.)\n\nEven if she saves me two hours per week, she has paid for herself, and believe me, she saves me much more than that.\n\n### Never Decline A Contract\n\nI mentioned this earlier in the post, but I want to reiterate it here.  I seldom tell clients \u0026#8220;no\u0026#8221; and I really feel that it has worked out to my benefit.  At the very least, I hear them out and add them as a contact to keep in mind for the future.\n\nWhat I generally do when I can\u0026#8217;t take on a client is I will give them an estimate of when myself or a member of my team will be available.  That way, if they are okay with the timeline, I can keep the pipeline open.  If not, there is no harm done.  Also, if I hire another developer before the time I said I was available, sometimes the client will still have the need and I am able to fill it.\n\nIf I absolutely don\u0026#8217;t have time or don\u0026#8217;t want a particular contract, I will refer the client out to other dev shops.  I don\u0026#8217;t look at this as competition, but rather opportunity as I would hope they would do the same for me one day.  As an added bonus, some of them have a referral fee so you can at least profit from pairing the client up.\n\n### Taxes\n\nI have found out that taxes are less fun when you are self-employed than when you are employed by a business.  Luckily my wife is MUCH better at money management than I am, so she set up a separate tax account where roughly 40% of our income would go.\n\nOne of the other good decisions I made besides hiring an assistant was hiring a CPA.  She has saved me countless hours and fees and is worth her weight in gold.\n\nHire a CPA from day one; you will never regret it.\n\n### Family\n\nI know this is a \u0026#8220;business\u0026#8221; related post, but I have to mention this.  Having a wife and kids, I am very much a family man.  Working for myself has been such a blessing since I have been able to spend considerably more time with my family than when I was employed by someone else.\n\nFor example, if it\u0026#8217;s a nice summer day and the family decides to head to the zoo, I can just go without asking a boss for time off or taking PTO.  I simply work in the evening or more hours the next day to recoup the time.  Personal time management is key to be able to have this kind of freedom.\n\n### Summary\n\nOverall, 2013 was an incredible year.  While I did make mistakes (a ton), I gained so much knowledge and had a blast doing so.  Going solo isn\u0026#8217;t for everyone (some days I wonder why everyone** isn\u0026#8217;t** doing it, and others I wonder why I **am**), but it\u0026#8217;s been one of the most exciting experiences of my life.\n\nI look forward to what 2014 brings and seeing how I can continue to grow my consultancy.\n\nHappy New Year and Happy Hacking!\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"What I Learned In My First Year Of iOS Consulting\" data-url=\"http://brandontreb.com/learned-first-year-ios-consulting\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n\n [1]: http://brandontreb.com/what-i-learned-in-my-first-month-being-a-contract-ios-developer\n",
  "permalink" : "https://brandontreb.ngrok.io/2014/01/01/learned-first-year-ios-consulting/",
  "date":"2014-01-01T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2014-01-01T00:00:00Z","post_type":"article","publishdate":"2014-01-01T00:00:00Z","slug":"learned-first-year-ios-consulting","tags":["iPhone","Articles","consulting","contracting","developer","featured","ios","contracts","treb","studios","iPhone Programming"],"title":"What I Learned In My First Year Of iOS Consulting","type":"post"
}