{
  "name": "Amazon \u0026#8211; A Terrible Solution To A Huge Problem",  
  "content": "tl;dr; Don\u0026#8217;t buy a Kindle Fire for your kid until they resolve the parental control issues. Wifi password protection is their current solution, and it sucks.\n\nLike many parents, I thought it would be a good idea to get a tablet device for my son so that he could play some *educational* games and watch some Netflix (in moderation of course). After doing quite a bit of research, I settled on the Kindle Fire. Before the Apple fanboys give me crap, know that I am one, I have an iPad, it\u0026#8217;s too expensive for my son.\n\nHonestly, I really love the fire. I think it has the *least terrible* Android interface of any of the devices. It\u0026#8217;s intuitive and my 3 year old was able to grasp navigation right away. In addition to navigation, he quickly figured out how to acquire new content (apps, video, children\u0026#8217;s books) thanks to Amazon\u0026#8217;s \u0026#8220;One-Click Ordering\u0026#8221;. Obviously, Amazon thought the process they use on the web transfered well to a tablet device and was not willing to compromise on that. That\u0026#8217;s neither here nor there. You can find plenty of posts about user\u0026#8217;s complaining about the **initial** lack of parental controls.\n\n#### The Update\n\nShortly after receiving some pretty rough reviews for their interface, Amazon rolled out their first update which brought us to 6.2.1. In addition to fixing some of there terribly choppy UI, they rolled out their \u0026#8220;fix\u0026#8221; for the lack of parental controls.\n\nI noticed a new security setting that I had hoped would allow the device to require a password for content purchase, but it turns out the setting is to password protect enabling wifi.\n\n**Password protect enabling wifi? Really?**\n\nThis is laughable at best. What a worthless feature. I could not figure out why anyone would ever want that. And then I had a conversation with \u0026#8220;tech support\u0026#8221;.\n\n#### Their \u0026#8220;Solution\u0026#8221; Confirmed\n\nAfter seeing an email from Amazon the other day showing my purchase for $17.99 for Team Umizoomi Season 1 (whatever the crap that is), which obviously my son purchased, I set out to chat with customer support. The conversation went something like this:\n\n\u003e \u0026#8230;  \n\u003e   \n\u003e **Me:** Refund!? No parental controls!\n\u003e \n\u003e **Outsourced Guy:** Enable Wifi Password = protection!\n\u003e \n\u003e **Me:** No, watch Netflix! Browse Web! Stupid Solution\n\u003e \n\u003e **Outsourced Guy:** Yes Netflix Need Wifi. Did I solve your problem?\n\u003e \n\u003e **Me:** ?\n\u003e \n\u003e **Outsourced Guy:** Phone Number. Call Video Support\n\nSo there you have it. Amazon actually pushes this as their solution to the lack of parental controls. My suspicions were confirmed by Outsourced Guy.\n\n#### Conclusion\n\nIt\u0026#8217;s sad that a huge company such as Amazon feels that *their process* is more important than listening to their customers. Although their devices have been selling like *fire* (badum ch!), they need to address such gaping issues if they are to maintain their edge in the \u0026#8220;affordable\u0026#8221; tablet space. Especially as the younger generations start embracing the technology.\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Amazon - A Terrible Solution To A Huge Problem\" data-url=\"http://brandontreb.com/amazon-a-terrible-solution-to-a-huge-problem\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n",
  "permalink" : "https://brandon_swoop.ngrok.io/2012/01/16/amazon-a-terrible-solution-to-a-huge-problem/",
  "date":"2012-01-16T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2012-01-16T00:00:00Z","post_type":"article","publishdate":"2012-01-16T00:00:00Z","slug":"amazon-a-terrible-solution-to-a-huge-problem","tags":["Uncategorized"],"title":"Amazon \u0026#8211; A Terrible Solution To A Huge Problem","type":"post"
}