{
  "name": "Beginning Jailbroken iOS Development \u0026#8211; Getting The Tools",  
  "content": "Developing for [jailbroken][1] is actually quite similar to regular iOS development with one addition. More Power! oh oh oh (said in a Tim Taylor voice (sorry for non-Americans that don\u0026#8217;t get the reference)). With your device jailbroken, you have the ability to hook in to pretty much every class that Apple writes allowing you quite a bit of control over the iPhone\u0026#8217;s functionality.\n\nIn today\u0026#8217;s tutorial, I will simply be discussing the best way to get up and running with the tools necessary to write a jailbroken iPhone app. We will not be doing any coding, however this tutorial will be necessary for all posts going forward.\n\n**Theos**\n\nThere are many ways to go about writing a jailbroken iOS app. Most of them are quite complex. [@DHowett][2] has come up with a brilliant tool called [theos][3] which drastically simplifies the process. My tutorial will pretty much be a regurgitation of his tutorial [found here][3] with some added cheesy jokes.\n\nTheos is a command line utility that essentially generates a template for creating applications, libraries, preference bundles, tools, and mobile substrate hacks. These cover 99% of the jailbroken apps that you are likely to create.\n\nOne thing to note is DHowett talks about doing jailbroken iOS development on both Mac and Linux; my tutorials will be Mac-only.\n\n#### Step 1: Install the iOS SDK\n\nYou will first need to install the official iOS SDK.\n\n\u003chttp://developer.apple.com/devcenter/ios/index.action\u003e\n\nYou can register for a free account and download the latest SDK. Once installed reboot your Mac and come back here. I\u0026#8217;ll wait\u0026#8230;\n\n#### Step 2: Setting Up The Environment Variables\n\nStart by deciding on a good location to install theos. The suggested location is */opt/theos*. The only issue with doing it here is you will need to have administrator permissions as well as have to enter your password when updating files. For teaching purposes, I am going to assume you will install it here too.\n\nOpen the terminal and type:\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u0026lt;code class=’bash’\u003eexport THEOS=/opt/theos\u0026lt;/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\nWhat we are doing is setting an environment variable. You can always see if this variable is set by typing *echo $THEOS* in the command line. It will need to be (re)set every time you reopen the terminal to develop a jailbroken app.\n\n#### Step 3: Getting theos\n\nDHowett uses subversion for version control on theos, so you need to make sure and have it installed. If you followed step one above, it should have been installed by default. We will be checking out theos into the THEOS directory specified in step 2.\n\nIn the terminal type:\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u0026lt;code class=’bash’\u003esvn co http://svn.howett.net/svn/theos/trunk $THEOS\u0026lt;/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\nYou most likely will be asked for your password. You should now see the */opt/theos* directory created with theos installed.\n\n#### Step 4: Getting ldid\n\nWe now need to install the ldid tool. ldid is a tool written by [Saurik][4] (if you don\u0026#8217;t know who he is, stop reading now). Basically, it simulates the signing process for the iPhone, allowing you to install your jailbroken apps/hacks on an actual device.\n\nYou can find this tool in many places, however DHowett has generously hosted it for us on his dropbox account.\n\nNow, I had a tricky time getting this to download directly to my */opt/theos* folder. So, I downloaded it to my desktop and then moved it in to */opt/theos/bin/ldid*\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u0026lt;code class=’bash’\u003ecurl -s http://dl.dropbox.com/u/3157793/ldid \u0026gt; ~/Desktop/ldid\nchmod +x ~/Desktop/ldid\nmv ~/Desktop/ldid $THEOS/bin/ldid\u0026lt;/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\nAlternatively, if you can get it to work properly, do it like DHowett suggests and download it directly into place.\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u0026lt;code class=’bash’\u003ecurl -s http://dl.dropbox.com/u/3157793/ldid \u0026gt; $THEOS/bin/ldid; chmod +x $THEOS/bin/ldid\u0026lt;/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\n#### Step 5: Install dpkg\n\nDpkg is a tool to bundle up your app into a Debian package for distribution in a Cydia repository. You can install it through Macports.\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u0026lt;code class=’bash’\u003esudo port install dpkg\u0026lt;/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\n#### Step 6: Creating A New Project\n\ntheos uses a tool called nic (new instance creator) to create a new project. Simply run nic by typing:\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u0026lt;code class=’bash’\u003e$THEOS/bin/nic.pl\u0026lt;/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\nand it starts the new instance creator. Here is a sample of making a jailbroken application.\n\n\u003cdiv\u003e\n  \u003cpre\u003e\u0026lt;code class=’bash’\u003ebrandon-trebitowskis-macbook-pro:Desktop brandontreb$ $THEOS/bin/nic.pl\nNIC 1.0 - New Instance Creator\n——————————\n  [1.] iphone/application\n  [2.] iphone/library\n  [3.] iphone/preference_bundle\n  [4.] iphone/tool\n  [5.] iphone/tweak\nChoose a Template (required): 1\nProject Name (required): FartLight\nPackage Name [com.yourcompany.fartlight]: com.brandontreb.fartlight\nAuthor/Maintainer Name [Brandon Trebitowski]: \nInstantiating iphone/application in fartlight/…\nDone.\u0026lt;/code\u003e\u003c/pre\u003e\n\u003c/div\u003e\n\nThis will create a new folder with a basic template called fartlight (killer project, I know). In addition to the usual files it will contain a Makefile (for building the application) and a control file (information about the application when it\u0026#8217;s in a Cydia repository).\n\nThis should now give you the basis for creating a jailbroken application/tweak/hack. In the next tutorial we will go over building, signing, and deployment. For now, you can check out the project I created with nic called [inPulseNotifier][5]. It\u0026#8217;s a combination of a tweak (5) and a preference bundle (3) for the app settings.\n\nFeel free to ask me a question in the comments and check out #theos on IRC.\n\n**Update** [Check out the next tutorial in this series here][6].\n\nHappy coding!\n\n\u003cdiv style=\"\"\u003e\n  \u003ca href=\"http://twitter.com/share\" class=\"twitter-share-button\" data-count=\"horizontal\" data-text=\"Beginning Jailbroken iOS Development - Getting The Tools\" data-url=\"http://brandontreb.com/beginning-jailbroken-ios-development-getting-the-tools\"  data-via=\"brandontreb\" data-related=\"brandontreb:\"\u003eTweet\u003c/a\u003e\n\u003c/div\u003e\n\n [1]: http://en.wikipedia.org/wiki/IOS_jailbreaking\n [2]: http://twitter.com/dhowett\n [3]: http://iphonedevwiki.net/index.php/Theos/Getting_Started\n [4]: http://www.saurik.com/\n [5]: https://github.com/brandontreb/inPulseNotifier\n [6]: /beginning-jailbroken-ios-development-building-and-deployment/\n",
  "permalink" : "https://brandon_swoop.ngrok.io/2011/04/11/beginning-jailbroken-ios-development-getting-the-tools/",
  "date":"2011-04-11T00:00:00Z","draft":false,"iscjklanguage":false,"lastmod":"2011-04-11T00:00:00Z","post_type":"article","publishdate":"2011-04-11T00:00:00Z","slug":"beginning-jailbroken-ios-development-getting-the-tools","tags":["iPhone"],"title":"Beginning Jailbroken iOS Development \u0026#8211; Getting The Tools","type":"post"
}